// Завдання 1
// 1. Створіть порожній об'єкт з ім'ям student.
// 2. Додайте до об'єкта student наступні властивості:
//      a. firstName: рядок, представляє ім'я студента.
//      b. lastName: рядок, представляє прізвище студента.
//      c. age: число, представляє вік студента.
//      d. courses: масив, представляє список курсів, які він вивчає
// (наприклад, ["Математика", "Історія", "Програмування"]).
// 3. Виведіть об'єкт student в консоль.

// порожний об'єкт
const student = {};

// додавання властивостей
student.firstName = "Bruce";
student.lastName = "Lee";
student.age = 33;
student.courses = ["Wushu", "Kungfu", "Yunchun"];

//вивід в консоль
console.log(student);
