// Завдання 3
// 1. Створіть об'єкт car1 з такими властивостями:
//      a. brand: рядок, представляє марку автомобіля.
//      b. model: рядок, представляє модель автомобіля.
//      c. year: число, представляє рік випуску автомобіля.
// 2. Створіть об'єкт car2 з такими властивостями:
//      a. brand: рядок, представляє марку автомобіля.
//      b. model: рядок, представляє модель автомобіля.
//      c. owner: число, представляє рік випуску автомобіля.
// 3. Створіть об'єкт car3. Використайте оператор spread,
// щоб додати всі властивості що є в car1 та car2 до об’єкту car3.
// 4. Виведіть об'єкт car3 в консоль.

const car1 = {
    brand: "BMW",
    model: "X5",
    year: 2025,
};

const car2 = {
    brand: "Mercedes",
    model: "GLC",
    owner: "Oleksii",
};

const car3 = {
    ...car1,
    ...car2,
};

console.log(car3);
