// Завдання 3: Генерація таблиці множення

// Створіть програму, яка генерує таблицю множення для обраного 
// числа за допомогою кожного з циклів for, while .

// Виберіть число для якого потрібно згенерувати таблицю множення.
// Використовуючи цикл for, створіть таблицю множення для обраного числа від 1 до 10. 
// Виведіть результат в консоль.
// Використовуючи цикл while створіть аналогічну таблицю множення та виведіть її в консоль.
// 
// Приклад вхідних даних: 
// const number = 5;
// Очікуваний результат:
// 5 x 1 = 5
// 5 x 2 = 10
// 5 x 3 = 15
// 5 x 4 = 20
// 5 x 5 = 25
// 5 x 6 = 30
// 5 x 7 = 35
// 5 x 8 = 40
// 5 x 9 = 45
// 5 x 10 = 50

const number = 5;

console.log('Taблицю множення з for')
for (let i = 1; i <= 10; i++) {
    let result = number * i;
    console.log(`${number}X${i} = ${result}`);
}

console.log('\nTaблицю множення з while')
let j = 1;

while (j <= 10) {
    let result = number * j;
    console.log(`${number}X${j} = ${result}`);
    j++;
}