/*Завдання 4.1

π - число “пі”. Ви можете використати Math.PI у вашому дз для вираження цього числа

Створіть змінну radius і присвойте їй числове значення радіуса кола.
Обчисліть площу кола за формулою π * radius^2 і виведіть результат.

Округліть кожне отримане значення до 2 значень після крапки.*/

//Створення змінної радуса
let radius = 20;

//Створення змінної площіни круга + формула
let circleArea = Math.PI * radius ** 2;

//Створення змінно округлення до 2 значень після крапки
let roundedCircleArea = circleArea.toFixed(2);

console.log("Radius", radius);
console.log("Area", roundedCircleArea);


