/*Завдання 4.2

Створіть змінну length і присвойте їй числове значення довжини прямокутника.
Створіть змінну width і присвойте їй числове значення ширини прямокутника.
Обчисліть площу прямокутника за формулою length * width і виведіть результат.

Округліть кожне отримане значення до 2 значень після крапки.*/

//Створення змінної length та присвоєння їй числового значення довжини прямокутника.
const length = 30;

//Створення змінної width та присвоєння їй числового значення ширини прямокутника.
const width = 15;

//Створення змінної площі прямокутника за формулою length * width
const rectangleArea = length * width;

//Округлення значення до 2 значень після крапки.
const roundedRectangleArea = rectangleArea.toFixed(2);

console.log("Lengthe", length);
console.log("Width", width);
console.log("Area", roundedRectangleArea);